package main

import (
	"fmt"
	"go_base/src/go_code/my_regexp/regexp_utils"
)

// 正则匹配各种时间
func main1() {
	fmt.Println("wufuqiang")
	var str string = `"2020-04-11" 20:44:39.432"from":0,   "size": 10000,20220411"sort": [2020-06-20T00:00:00+08:00   2022-04-11  { 5. 2022-04-11T23:49:40.341Z 5. 2022-04-11T23:49:40.341Z  `
	//var reg string = `\b16\d{11}\b` // 16开头、13位的时间戳-毫秒
	//var reg string = `\b\d{13}\b`  // 13位的时间戳-毫秒
	//var reg string = `\b16\d{8}\b` // 16开头、10位的时间戳-秒
	//var reg string = `\b\d{10}\b` // 10位的时间戳-秒
	//var reg string = `\b[0-9]{4}[-][0-9]{1,2}[-][0-9]{1,2}[ ][0-9]{1,2}[:][0-9]{1,2}[:][0-9]{1,2}\b` //2022-04-11 20:44:39
	//var reg string = `\b[0-9]{4}[-][0-9]{1,2}[-][0-9]{1,2}[T][0-9]{1,2}[:][0-9]{1,2}[:][0-9]{1,2}[.][0-9]{1,3}Z\b` //2022-04-11T23:49:40.341Z
	//var reg string = `\b[0-9]{4}[-][0-9]{1,2}[-][0-9]{1,2}[T][0-9]{1,2}[:][0-9]{1,2}[:][0-9]{1,2}[+]00:00\b` //2022-04-11T23:49:40.341Z
	//var reg string = `\b[0-9]{4}[-][0-9]{1,2}[-][0-9]{1,2}[T][0-9]{1,2}[:][0-9]{1,2}[:][0-9]{1,2}[+]08:00\b` //2022-04-11T23:49:40.341Z
	var reg string = `\b[0-9]{4}[-][0-9]{1,2}[-][0-9]{1,2}` //2022-04-11
	//var reg string = `\b[0-9]{4}[0-9]{1,2}[0-9]{1,2}\b` //20220411

	regexp_utils.GetString(reg, str)
}

func main() {
	regexp_utils.GetAllNum()
}
